export const rankOptions = [
  {
    label: "ทั่วไป",
    options: [
      { value: "นาย", label: "นาย" },
      { value: "นางสาว", label: "นางสาว" },
      { value: "นาง", label: "นาง" },
      { value: "คุณหญิง", label: "คุณหญิง" },
    ],
  },
  {
    label: "ทหารบก (ชาย)",
    options: [
      { value: "พล.อ.", label: "พล.อ." },
      { value: "พล.ท.", label: "พล.ท." },
      { value: "พล.ต.", label: "พล.ต." },
      { value: "พ.อ.", label: "พ.อ." },
      { value: "พ.ท.", label: "พ.ท." },
      { value: "พ.ต.", label: "พ.ต." },
      { value: "ร.อ.", label: "ร.อ." },
      { value: "ร.ท.", label: "ร.ท." },
      { value: "ร.ต.", label: "ร.ต." },
      { value: "จ.ส.อ.", label: "จ.ส.อ." },
      { value: "จ.ส.ท.", label: "จ.ส.ท." },
      { value: "จ.ส.ต.", label: "จ.ส.ต." },
      { value: "ส.อ.", label: "ส.อ." },
      { value: "ส.ท.", label: "ส.ท." },
      { value: "ส.ต.", label: "ส.ต." },
      { value: "พล.อส.", label: "พล.อส." },
    ],
  },
  {
    label: "ทหารบก (หญิง)",
    options: [
      { value: "พล.อ.หญิง", label: "พล.อ.หญิง" },
      { value: "พล.ท.หญิง", label: "พล.ท.หญิง" },
      { value: "พล.ต.หญิง", label: "พล.ต.หญิง" },
      { value: "พ.อ.หญิง", label: "พ.อ.หญิง" },
      { value: "พ.ท.หญิง", label: "พ.ท.หญิง" },
      { value: "พ.ต.หญิง", label: "พ.ต.หญิง" },
      { value: "ร.อ.หญิง", label: "ร.อ.หญิง" },
      { value: "ร.ท.หญิง", label: "ร.ท.หญิง" },
      { value: "ร.ต.หญิง", label: "ร.ต.หญิง" },
      { value: "จ.ส.อ.หญิง", label: "จ.ส.อ.หญิง" },
      { value: "จ.ส.ท.หญิง", label: "จ.ส.ท.หญิง" },
      { value: "จ.ส.ต.หญิง", label: "จ.ส.ต.หญิง" },
      { value: "ส.อ.หญิง", label: "ส.อ.หญิง" },
      { value: "ส.ท.หญิง", label: "ส.ท.หญิง" },
      { value: "ส.ต.หญิง", label: "ส.ต.หญิง" },
      { value: "พล.อส.หญิง", label: "พล.อส.หญิง" },
    ],
  },
  {
    label: "ทหารเรือ (ชาย)",
    options: [
      { value: "พล.ร.อ.", label: "พล.ร.อ." },
      { value: "พล.ร.ท.", label: "พล.ร.ท." },
      { value: "พล.ร.ต.", label: "พล.ร.ต." },
      { value: "น.อ.(ร.น.)", label: "น.อ.(ร.น.)" },
      { value: "น.ท.(ร.น.)", label: "น.ท.(ร.น.)" },
      { value: "น.ต.(ร.น.)", label: "น.ต.(ร.น.)" },
      { value: "ร.อ.(ร.น.)", label: "ร.อ.(ร.น.)" },
      { value: "ร.ท.(ร.น.)", label: "ร.ท.(ร.น.)" },
      { value: "ร.ต.(ร.น.)", label: "ร.ต.(ร.น.)" },
      { value: "พ.จ.อ.", label: "พ.จ.อ." },
      { value: "พ.จ.ท.", label: "พ.จ.ท." },
      { value: "พ.จ.ต.", label: "พ.จ.ต." },
      { value: "จ.อ.", label: "จ.อ." },
      { value: "จ.ท.", label: "จ.ท." },
      { value: "จ.ต.", label: "จ.ต." },
    ],
  },
  {
    label: "ทหารเรือ (หญิง)",
    options: [
      { value: "พล.ร.อ.หญิง", label: "พล.ร.อ.หญิง" },
      { value: "พล.ร.ท.หญิง", label: "พล.ร.ท.หญิง" },
      { value: "พล.ร.ต.หญิง", label: "พล.ร.ต.หญิง" },
      { value: "น.อ.(ร.น.)หญิง", label: "น.อ.(ร.น.)หญิง" },
      { value: "น.ท.(ร.น.)หญิง", label: "น.ท.(ร.น.)หญิง" },
      { value: "น.ต.(ร.น.)หญิง", label: "น.ต.(ร.น.)หญิง" },
      { value: "ร.อ.(ร.น.)หญิง", label: "ร.อ.(ร.น.)หญิง" },
      { value: "ร.ท.(ร.น.)หญิง", label: "ร.ท.(ร.น.)หญิง" },
      { value: "ร.ต.(ร.น.)หญิง", label: "ร.ต.(ร.น.)หญิง" },
      { value: "พ.จ.อ.หญิง", label: "พ.จ.อ.หญิง" },
      { value: "พ.จ.ท.หญิง", label: "พ.จ.ท.หญิง" },
      { value: "พ.จ.ต.หญิง", label: "พ.จ.ต.หญิง" },
      { value: "จ.อ.หญิง", label: "จ.อ.หญิง" },
      { value: "จ.ท.หญิง", label: "จ.ท.หญิง" },
      { value: "จ.ต.หญิง", label: "จ.ต.หญิง" },
    ],
  },
  {
    label: "ทหารอากาศ (ชาย)",
    options: [
      { value: "พล.อ.อ.", label: "พล.อ.อ." },
      { value: "พล.อ.ท.", label: "พล.อ.ท." },
      { value: "พล.อ.ต.", label: "พล.อ.ต." },
      { value: "น.อ.", label: "น.อ." },
      { value: "น.ท.", label: "น.ท." },
      { value: "น.ต.", label: "น.ต." },
      { value: "ร.อ.", label: "ร.อ." },
      { value: "ร.ท.", label: "ร.ท." },
      { value: "ร.ต.", label: "ร.ต." },
      { value: "พ.อ.อ.", label: "พ.อ.อ." },
      { value: "พ.อ.ท.", label: "พ.อ.ท." },
      { value: "พ.อ.ต.", label: "พ.อ.ต." },
      { value: "จ.อ.", label: "จ.อ." },
      { value: "จ.ท.", label: "จ.ท." },
      { value: "จ.ต.", label: "จ.ต." },
    ],
  },
  {
    label: "ทหารอากาศ (หญิง)",
    options: [
      { value: "พล.อ.อ.หญิง", label: "พล.อ.อ.หญิง" },
      { value: "พล.อ.ท.หญิง", label: "พล.อ.ท.หญิง" },
      { value: "พล.อ.ต.หญิง", label: "พล.อ.ต.หญิง" },
      { value: "น.อ.หญิง", label: "น.อ.หญิง" },
      { value: "น.ท.หญิง", label: "น.ท.หญิง" },
      { value: "น.ต.หญิง", label: "น.ต.หญิง" },
      { value: "ร.อ.หญิง", label: "ร.อ.หญิง" },
      { value: "ร.ท.หญิง", label: "ร.ท.หญิง" },
      { value: "ร.ต.หญิง", label: "ร.ต.หญิง" },
      { value: "พ.อ.อ.หญิง", label: "พ.อ.อ.หญิง" },
      { value: "พ.อ.ท.หญิง", label: "พ.อ.ท.หญิง" },
      { value: "พ.อ.ต.หญิง", label: "พ.อ.ต.หญิง" },
      { value: "จ.อ.หญิง", label: "จ.อ.หญิง" },
      { value: "จ.ท.หญิง", label: "จ.ท.หญิง" },
      { value: "จ.ต.หญิง", label: "จ.ต.หญิง" },
    ],
  },
  {
    label: "ตำรวจ (ชาย)",
    options: [
      { value: "พล.ต.อ.", label: "พล.ต.อ." },
      { value: "พล.ต.ท.", label: "พล.ต.ท." },
      { value: "พล.ต.ต.", label: "พล.ต.ต." },
      { value: "พ.ต.อ.", label: "พ.ต.อ." },
      { value: "พ.ต.ท.", label: "พ.ต.ท." },
      { value: "พ.ต.ต.", label: "พ.ต.ต." },
      { value: "ร.ต.อ.", label: "ร.ต.อ." },
      { value: "ร.ต.ท.", label: "ร.ต.ท." },
      { value: "ร.ต.ต.", label: "ร.ต.ต." },
      { value: "ด.ต.", label: "ด.ต." },
      { value: "ส.ต.อ.", label: "ส.ต.อ." },
      { value: "ส.ต.ท.", label: "ส.ต.ท." },
      { value: "ส.ต.ต.", label: "ส.ต.ต." },
    ],
  },
  {
    label: "ตำรวจ (หญิง)",
    options: [
      { value: "พล.ต.อ.(หญิง)", label: "พล.ต.อ.(หญิง)" },
      { value: "พล.ต.ท.(หญิง)", label: "พล.ต.ท.(หญิง)" },
      { value: "พล.ต.ต.(หญิง)", label: "พล.ต.ต.(หญิง)" },
      { value: "พ.ต.อ.(หญิง)", label: "พ.ต.อ.(หญิง)" },
      { value: "พ.ต.ท.(หญิง)", label: "พ.ต.ท.(หญิง)" },
      { value: "พ.ต.ต.(หญิง)", label: "พ.ต.ต.(หญิง)" },
      { value: "ร.ต.อ.(หญิง)", label: "ร.ต.อ.(หญิง)" },
      { value: "ร.ต.ท.(หญิง)", label: "ร.ต.ท.(หญิง)" },
      { value: "ร.ต.ต.(หญิง)", label: "ร.ต.ต.(หญิง)" },
      { value: "ด.ต.(หญิง)", label: "ด.ต.(หญิง)" },
      { value: "ส.ต.อ.(หญิง)", label: "ส.ต.อ.(หญิง)" },
      { value: "ส.ต.ท.(หญิง)", label: "ส.ต.ท.(หญิง)" },
      { value: "ส.ต.ต.(หญิง)", label: "ส.ต.ต.(หญิง)" },
    ],
  },
];

// // app/api/ranks/route.ts
// import { NextResponse } from "next/server";

// export async function GET() {
//   const data = {
//     "ทั่วไป": [
//       { value: "นาย", label: "นาย" },
//       { value: "นางสาว", label: "นางสาว" },
//       { value: "นาง", label: "นาง" },
//       { value: "คุณหญิง", label: "คุณหญิง" },
//     ],
//     "ทหารบก (ชาย)": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//   };

//   return NextResponse.json(data);
// }
