export const departmentOptions = [
  {
    label: "ศูนย์เทคโนโลยีดิจิทัลฯ",
    options: [
      {
        value: "กองบังคับการ",
        label: "กองบังคับการ",
      },
      {
        value: "กองระบบเครือข่ายสารสนเทศและความปลอดภัย",
        label: "กองระบบเครือข่ายสารสนเทศและความปลอดภัย",
      },
      {
        value: "กองสนับสนุนสารสนเทศและการสื่อสาร",
        label: "กองสนับสนุนสารสนเทศและการสื่อสาร",
      },
      {
        value: "กองการศึกษา วิจัย และพัฒนา",
        label: "กองการศึกษา วิจัย และพัฒนา",
      },
      {
        value: "กองบริการปฏิบัติการสารสนเทศ",
        label: "กองบริการปฏิบัติการสารสนเทศ",
      },
    ],
  },
  {
    label: "สำนักองคมนตรี",
    options: [
      {
        value: "สำนักงานเลขาธิการองคมนตรี",
        label: "สำนักงานเลขาธิการองคมนตรี",
      },
      {
        value: "กองนิติการ",
        label: "กองนิติการ",
      },
    ],
  },
  {
    label: "กรมบังคับการสำนักพระราชวัง",
    options: [
      {
        value: "กองกลาง",
        label: "กองกลาง",
      },
      {
        value: "กองการเจ้าหน้าที่",
        label: "กองการเจ้าหน้าที่",
      },
      {
        value: "กองคลัง",
        label: "กองคลัง",
      },
      {
        value: "สำนักงานพระคลังข้างที่",
        label: "สำนักงานพระคลังข้างที่",
      },
      {
        value: "สำนักงานผู้บังคับบัญชา สำนักพระราชวัง",
        label: "สำนักงานผู้บังคับบัญชา สำนักพระราชวัง",
      },
    ],
  },
  {
    label: "กรมมหาดเล็ก 904",
    options: [
      {
        value: "สำนักงานผู้บังคับบัญชากรมมหาดเล็ก 904",
        label: "สำนักงานผู้บังคับบัญชากรมมหาดเล็ก 904",
      },
      {
        value: "กองพระราชภารกิจในพระองค์ 904",
        label: "กองพระราชภารกิจในพระองค์ 904",
      },
      {
        value: "กองกิจการในพระองค์เขตพระราชฐานชั้นในสุด",
        label: "กองกิจการในพระองค์เขตพระราชฐานชั้นในสุด",
      },
      {
        value: "กองกิจการในพระองค์เขตพระราชฐานชั้นใน",
        label: "กองกิจการในพระองค์เขตพระราชฐานชั้นใน",
      },
      {
        value: "กองกิจการในพระองค์เขตพระราชฐานและสนับสนุนงานราชสำนัก",
        label: "กองกิจการในพระองค์เขตพระราชฐานและสนับสนุนงานราชสำนัก",
      },
      {
        value: "กองรักษาเขตพระราชฐานงานชาวที่และระบบ 904",
        label: "กองรักษาเขตพระราชฐานงานชาวที่และระบบ 904",
      },
      {
        value: "กองราชการฝ่ายในและงานฝ่ายในพระบรมมหาราชวัง",
        label: "กองราชการฝ่ายในและงานฝ่ายในพระบรมมหาราชวัง",
      },
      {
        value: "กองพระราชพาหนะ 904",
        label: "กองพระราชพาหนะ 904",
      },
      {
        value: "กองพระราชอุทยานและภูมิสถาปัตย์",
        label: "กองพระราชอุทยานและภูมิสถาปัตย์",
      },
      {
        value: "กองแพทย์ราชสำนักและแพทย์ประจำพระองค์",
        label: "กองแพทย์ราชสำนักและแพทย์ประจำพระองค์",
      },
      {
        value: "กองพระราชพิธี",
        label: "กองพระราชพิธี",
      },
      {
        value: "กองตำรวจวังประจำพระองค์และรับรอง",
        label: "กองตำรวจวังประจำพระองค์และรับรอง",
      },
      {
        value: "กองธุรการที่ประทับ",
        label: "กองธุรการที่ประทับ",
      },
      {
        value: "กองสื่อสารและอิเล็กทรอนิกส์ในพระองค์",
        label: "กองสื่อสารและอิเล็กทรอนิกส์ในพระองค์",
      },
      {
        value: "กองช่างภาพและภาพยนต์ส่วนพระองค์",
        label: "กองช่างภาพและภาพยนต์ส่วนพระองค์",
      },
      {
        value:
          "กองพระเครื่องต้นและครัวบริพารเขตพระราชฐาน และบก. ห้องเครื่องเขตพระราชฐาน 904",
        label:
          "กองพระเครื่องต้นและครัวบริพารเขตพระราชฐาน และบก. ห้องเครื่องเขตพระราชฐาน 904",
      },
      {
        value: "กองพระราชมรดกและบูรณะในพระองค์",
        label: "กองพระราชมรดกและบูรณะในพระองค์",
      },
      {
        value: "กองสถาปนิกและก่อสร้างในพระองค์",
        label: "กองสถาปนิกและก่อสร้างในพระองค์",
      },
      {
        value: "บก.กรมมหาดเล็ก เขตพระราชฐานชั้นในสุด",
        label: "บก.กรมมหาดเล็ก เขตพระราชฐานชั้นในสุด",
      },
    ],
  },
  {
    label: "กรมกิจการในสมเด็จพระนางเจ้าฯ พระบรมราชินี",
    options: [
      {
        value:
          "สำนักงานผู้บังคับบัญชากรมกิจการในสมเด็จพระนางเจ้าฯ พระบรมราชินี",
        label:
          "สำนักงานผู้บังคับบัญชากรมกิจการในสมเด็จพระนางเจ้าฯ พระบรมราชินี",
      },
      {
        value:
          "กองราชเลขานุการในพระองค์สมเด็จพระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง",
        label:
          "กองราชเลขานุการในพระองค์สมเด็จพระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง",
      },
      {
        value: "กองราชสำนักสมเด็จพระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง",
        label: "กองราชสำนักสมเด็จพระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง",
      },
      {
        value: "กองศิลปาชีพ",
        label: "กองศิลปาชีพ",
      },
      {
        value: "สถาบันสิริกิติ์",
        label: "สถาบันสิริกิติ์",
      },
    ],
  },
  {
    label: "กรมสนับสนุน",
    options: [
      {
        value: "กองรักษาเขตพระราชฐานพระบรมมหาราชวัง",
        label: "กองรักษาเขตพระราชฐานพระบรมมหาราชวัง",
      },
      {
        value: "กองงานพระราชฐานต่างจังหวัด",
        label: "กองงานพระราชฐานต่างจังหวัด",
      },
      {
        value: "กองสถาปัตยกรรม",
        label: "กองสถาปัตยกรรม",
      },
      {
        value: "กองแพทย์หลวง",
        label: "กองแพทย์หลวง",
      },
      {
        value: "กองศิลปกรรม",
        label: "กองศิลปกรรม",
      },
      {
        value: "กองรถยนต์หลวง",
        label: "กองรถยนต์หลวง",
      },
      {
        value: "กองครัวบริพารและประกอบเลี้ยงและคลังหลักห้องเครื่อง",
        label: "กองครัวบริพารและประกอบเลี้ยงและคลังหลักห้องเครื่อง",
      },
      {
        value: "กองสวนและภูมิสถาปัตย์",
        label: "กองสวนและภูมิสถาปัตย์",
      },
    ],
  },
  {
    label: "กรมราชเลขานุการในพระองค์",
    options: [
      { value: "กองการในพระองค์", label: "กองการในพระองค์" },
      {
        value: "กองการต่างประเทศ",
        label: "กองการต่างประเทศ",
      },
      {
        value: "กองจดหมายเหตุ สารสนเทศ และห้องสมุดหลวง",
        label: "กองจดหมายเหตุ สารสนเทศ และห้องสมุดหลวง",
      },
      {
        value: "กองเผยแพร่พระราชกรณียกิจ",
        label: "กองเผยแพร่พระราชกรณียกิจ",
      },
      {
        value: "กองงานพระราชานุเคราะห์",
        label: "กองงานพระราชานุเคราะห์",
      },
    ],
  },
  {
    label: "กรมกิจการในพระบรมวงศานุวงศ์",
    options: [
      {
        value:
          "กองงานในพระองค์สมเด็จพระกนิษฐาธิราชเจ้า กรมสมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี",
        label:
          "กองงานในพระองค์สมเด็จพระกนิษฐาธิราชเจ้า กรมสมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี",
      },
      {
        value:
          "กองงานในพระองค์สมเด็จพระเจ้าน้องนางเธอ กรมพระศรีสวางควัฒน วรขัตติยราชนารี",
        label:
          "กองงานในพระองค์สมเด็จพระเจ้าน้องนางเธอ กรมพระศรีสวางควัฒน วรขัตติยราชนารี",
      },
      {
        value: "กองงานในพระองค์พระเจ้าวรวงศ์เธอฯ กรมหมื่นสุทธนารีนาถ",
        label: "กองงานในพระองค์พระเจ้าวรวงศ์เธอฯ กรมหมื่นสุทธนารีนาถ",
      },
    ],
  },
  {
    label: "กรมกิจการพิเศษ",
    options: [
      {
        value: "โครงการส่วนพระองค์ / โครงการส่วนพระองค์ สวนจิตรลดา",
        label: "โครงการส่วนพระองค์ / โครงการส่วนพระองค์ สวนจิตรลดา",
      },
      {
        value:
          "โครงการส่วนพระองค์ / โครงการส่วนพระองค์สมเด็จพระกนิษฐาธิราชเจ้า กรมสมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี",
        label:
          "โครงการส่วนพระองค์ / โครงการส่วนพระองค์สมเด็จพระกนิษฐาธิราชเจ้า กรมสมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี",
      },
      {
        value:
          "โครงการส่วนพระองค์ / โครงการอนุรักษ์พันธุกรรมพืชอันเนื่องมาจากพระราชดำริ สมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี (อพ.สธ)",
        label:
          "โครงการส่วนพระองค์ / โครงการอนุรักษ์พันธุกรรมพืชอันเนื่องมาจากพระราชดำริ สมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี (อพ.สธ)",
      },
      {
        value:
          "โครงการส่วนพระองค์ / โครงการส่วนพระองค์สมเด็จพระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง",
        label:
          "โครงการส่วนพระองค์ / โครงการส่วนพระองค์สมเด็จพระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง",
      },
      {
        value: "โครงการส่วนพระองค์ / โครงการพัฒนาตามพระราชดำริ",
        label: "โครงการส่วนพระองค์ / โครงการพัฒนาตามพระราชดำริ",
      },
      {
        value: "มูลนิธิในพระองค์",
        label: "มูลนิธิในพระองค์",
      },
      {
        value: "กิจการงานศึกษาพระราชทานและโรงเรียนในพระราชูปถัมภ์",
        label: "กิจการงานศึกษาพระราชทานและโรงเรียนในพระราชูปถัมภ์",
      },
      {
        value: "โครงการในพระราชดำริ",
        label: "โครงการในพระราชดำริ",
      },
    ],
  },
  {
    label: "นถปภ.รอ.",
    options: [
      { value: "สำนักงานผู้บังคับบัญชา", label: "สำนักงานผู้บังคับบัญชา" },
      {
        value: "สำนักงานนายทหารปฏิบัติการพิเศษในพระองค์",
        label: "สำนักงานนายทหารปฏิบัติการพิเศษในพระองค์",
      },
      {
        value: "สำนักงานฝ่ายเสนาธิการในพระองค์",
        label: "สำนักงานฝ่ายเสนาธิการในพระองค์",
      },
      {
        value: "กองบัญชาการทหารมหาดเล็กราชวัลลภรักษาพระองค์",
        label: "กองบัญชาการทหารมหาดเล็กราชวัลลภรักษาพระองค์",
      },
      {
        value: "กองบัญชาการตำรวจราชองครักษ์ในพระองค์",
        label: "กองบัญชาการตำรวจราชองครักษ์ในพระองค์",
      },
    ],
  },
];

// // app/api/departments/route.ts
// import { NextResponse } from "next/server";

// export async function GET() {
//   const data = {
//     "ศูนย์เทคโนโลยีดิจิทัลฯ": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//     "": [
//
//     ],
//   };

//   return NextResponse.json(data);
// }
